MyMLP(
  (hidden1): Linear(in_features=178, out_features=89, bias=True)
  (hidden2): Linear(in_features=89, out_features=44, bias=True)
  (hidden3): Linear(in_features=44, out_features=22, bias=True)
  (hidden4): Linear(in_features=22, out_features=10, bias=True)
  (output): Linear(in_features=10, out_features=5, bias=True)
  (sigmoid): Sigmoid()
  (tanh): Tanh()
)