MyRNN(
  (rnn): GRU(1, 256, num_layers=2, batch_first=True, dropout=0.5)
  (fc1): Linear(in_features=256, out_features=128, bias=True)
  (fc2): Linear(in_features=128, out_features=64, bias=True)
  (fc3): Linear(in_features=64, out_features=5, bias=True)
)