MyVariableRNN(
  (fc1): Linear(in_features=911, out_features=128, bias=True)
  (fc2): Linear(in_features=128, out_features=64, bias=True)
  (tanh): Tanh()
  (rnn): GRU(64, 16, num_layers=2, batch_first=True, dropout=0.5)
  (fc3): Linear(in_features=16, out_features=2, bias=True)
)